import './domain/sight.dart';

final mocks = <Sight>[
  
  const Sight(
    name: 'Тюмень',
    type: 'Город',
    details: 'Столица деревень',
    lat: 57.152985,
    lon: 65.541227,
    url: 'https://visittyumen.ru/'
  ),
  
  const Sight(
    name: 'Екатеринбург он же ЕКБ, онже Ёбург, он же Свердловск 1 он же ЕКБ, онже Ёбург, он же Свердловск 2 он же ЕКБ, онже Ёбург, он же Свердловск 3',
    type: 'Город',
    details: 'он же ЕКБ, онже Ёбург, он же Свердловск 1 он же ЕКБ, онже Ёбург, он же Свердловск 2 он же ЕКБ, онже Ёбург, он же Свердловск 3 он же ЕКБ, онже Ёбург, он же Свердловск 4 он же ЕКБ, онже Ёбург, он же Свердловск 5 он же ЕКБ, онже Ёбург, он же Свердловск 6 он же ЕКБ, онже Ёбург, он же Свердловск 7',
    lat: 56.842752,
    lon: 60.605685,
    url: 'https://xn--80acgfbsl1azdqr.xn--p1ai/'
  ),

  const Sight(
    name: 'Челябинск',
    type: 'Город',
    details: 'Суровая кузнеца для слабого характером',
    lat: 55.159902,
    lon: 61.402554,
    url: 'https://cheladmin.ru/'
  ),

];
